1.The topology shows the network inside a university. The university has received "161.200.0.0/16" network. Since the number of hosts for each network is different, you'll divide the IP address into different sizes. Use VLSM technique to assign IP address to each network.

a.
Network 1 has 32,000 hosts.
Network 2 has 16,000 hosts.
Network 3 has 8,000 hosts.
Network 4 has 4,000 hosts.
Network 5 has 2,000 hosts.
Network 6 has 1,000 hosts.
Network 7 has 500 hosts.
Network 8 has 250 hosts.

VLSM (Variable Length Subnet Masking) Calculation Formula: `2^n - 2 ≥ number_of_hosts`; n = #hosts-bits, #network-bits = 32-#hosts-bits

Subnet Mask 32-bits: 255.255.255.0 = 11111111.11111111.11111111.00000000
IP Address: 192.168.1.10, network part: 192.168.1, host part: 10

Network 1 needs 32,000 hosts.
2^15 = 32,768 -> usable(-2) = 32,766 -> hosts bits = 15,
network bits = 32-15 = 17 -> subnet mask = 11111111.11111111.10000000.00000000 = 255.255.128.0
Base network: 161.200.0.0/16
Network Address/CIDR = 161.200.0.0/17
First Usable Address = Network Address + 1 = 161.200.0.1
Broadcast Address = Network Address + 2^15 - 1 = 161.200.127.255

Network 2 needs 16,000 hosts.
2^14 = 16,384 -> usable(-2) = 16,382 -> hosts bits = 14,
network bits = 32-14 = 18 -> subnet mask = 11111111.11111111.11000000.00000000 = 255.255.192.0
Network Address:
Network 1 already used:
161.200.0.0 – 161.200.127.255 (/17)
= 161.200.0|0000000.00000000 - 161.200.0|1111111.11111111
So the next block starts at: 161.200.10000000.00000000 = 161.200.128.0
First Usable Address = Network Address + 1 = 161.200.128.1 = 161.200.10|000000.00000001
2^14=16,384=256*"64" -> 161.200.128.0 + 64 blocks = 161.200.(128 + 64).0 = 161.200.192.0
Broadcast Address = Network Address + 2^14 - 1 = 161.200.191.255

b.From number of hosts described in previous bullet, subnet "161.200.0.0/16" network using VLSM technique to assign appropriate subnet mask to each subnet. Use the first subnet id for each network and use the second subnet id for dividing next network.

c.For network 1 to 8, assign first host IP address for router gigabit interface, second host IP address for host. If there are more than 1 host, assign less IP to the host which character comes first.

d.Network 9 to 16 are serial link, and create one more subnet which has the same size as Network 9 to 16 for NAT. We call the last network as Network 17.

Each serial link:
just 2 hosts (1 IP per router), total IPs = 4 (2 usable IPs+broadcast+network)
2^n - 2 >= 2 -> n = 2 -> network bits = 32-2 = 30 -> subnet mask = 255.255.255.252/30 = 11111111.11111111.11111111.11111100

e.Continue subnetting the first subnet of each new subnet until you have appropriate subnet mask to assign to each network.

f.For network 9 to 16, assign first host IP address to the router that has less number.

g.For private network, we use private class A IP address.


2.Cable the devices as shown in the topology. (You should use appropriate type of cable.)

Copper Straight-through: PC ↔ Switch, Router ↔ Switch
Copper Crossover: PC ↔ PC, Switch ↔ Switch, Router ↔ Router
Serial DCE: Router ↔ Router (click "(DCE)" side first)
Serial DCE Router Module: HWIC-2T, (turn off router first, then drag insert slot (left port 1, right port 0), then turn on router)

3.Configure basic routers and switches
I-Double click on the router/switch.
II-CLI panel.
III-`no` initial configuration.
`R1> enable` // `en`
`R1# configure terminal` // `conf t`

a. Disable DNS lookup.
`R1(config)# no ip domain-lookup` // `no ip domain-lo`

b. Configure device name as shown in the topology.
`R1(config)# hostname R1` // `host R1`

c. Enable password encryption.
`R1(config)# service password-encryption`

d. Assign ciscoexe as the privileged EXEC password.
`R1(config)# enable secret ciscoexe`

e. Assign ciscocon as the console password.
// Local physical access (via console cable)
`R1(config)# line console 0`
`R1(config-line)# password ciscocon` // `pass ciscocon`
`R1(config-line)# login`

f. Configure logging synchronous for the console line.
`R1(config-line)# logging synchronous` // `logg sync`

g. Assign ciscovty as the vty passwords.
// Remote access (via Telnet or SSH)
`R1(config)# line vty 0 4` // Apply this setting to all 5(0-4) VTY lines.
`R1(config-line)# password ciscovty`
`R1(config-line)# login`
`R1(config-line)# exit`

h. Configure a message of the day (MOTD) banner as "Unauthorized access is prohibited." (without"character)
```bash
R1(config)# ban motd #<HIT_ENTER>
Unauthorized access is prohibited.#<HIT_ENTER>
```
To Fix: `R1(config)# no banner motd`

i. Configure the IP address listed in the Addressing Table for all interfaces.
```bash
R1(config)# interface g0/0
R1(config-if)# ip address 161.200.0.1 255.255.128.0 // `ip add <IP address> <Subnet mask>`
R1(config-if)# no shutdown
R1(config-if)# exit
```
> loop this for all interfaces

j. Set the clock rate for all DCE serial interfaces at 128000.
`R1(config-if)# clock rate 128000`
`R1(config-if)# no shutdown` // `no shut`
`R1(config-if)# exit`

k. Copy the running configuration to the startup configuration.
`R1(config)# end`
`R1# copy running-config startup-config`

Shortened version:
```bash
R1> en
R1# conf t
R1(config)# no ip domain-lo
R1(config)# host R1
R1(config)# service password-encryption
R1(config)# enable secret ciscoexe
R1(config)# line con 0
R1(config-line)# pass ciscocon
R1(config-line)# login
R1(config-line)# logg sync
R1(config-line)# exit
R1(config)# line vty 0 4
R1(config-line)# pass ciscovty
R1(config-line)# login
R1(config-line)# exit
R1(config)# ban motd #<hit_enter>
Unauthorized access is prohibited.#<hit_enter>
R1(config)# int g0/0
R1(config-if)# ip add 161.200.0.1 255.255.128.0
R1(config-if)# no shut
R1(config-if)# ex
R1(config)# int s0/1/0
R1(config-if)# ip add 161.200.255.13 255.255.255.252
R1(config-if)# clock rate 128000
R1(config-if)# no shut
R1(config-if)# ex
R1(config)# end
R1# copy run start
```


4.Configure PC hosts
a. Assign IP addresses to all PCs except PC-K and PC-L that has the DHCP.
PC -> Desktop tab -> IP Configuration
Fill: IP Address,Subnet Mask(autofill), Default Gateway


5.Configure static route and default route on R1, R2, R3, R4 using exit interface only.
a. R1
i. Route to Network 3, 4, 10 exit on s0/0/0
ii. Route to Network 7, 16 exit on S0/0/1
iii. Default route exit on S0/1/0

Cisco allows you to configure static routes using either:
The next-hop IP: `ip route [network] [mask] [next-hop-IP]`
Or the exit interface: `ip route [network] [mask] [interface]` (preferred)
des_network_ip, des_subnet_mask, src(Rx)_exit_interface

```bash
R1> en
R1# conf t

! i. Routes via s0/0/0
R1(config)# ip route 161.200.192.0 255.255.224.0 s0/0/0
R1(config)# ip route 161.200.224.0 255.255.240.0 s0/0/0
R1(config)# ip route 161.200.255.4 255.255.255.252 s0/0/0

! ii. Routes via s0/0/1
R1(config)# ip route 161.200.252.0 255.255.254.0 s0/0/1
R1(config)# ip route 161.200.255.28 255.255.255.252 s0/0/1

! iii. Default route via s0/1/0
R1(config)# ip route 0.0.0.0 0.0.0.0 s0/1/0

R1(config)# end
R1# copy run start
```

b. R2 ...


6.Configure OSPF routing and default route on R5, R6, R7 with process id 1
a. Prevent routing update from being sent to all the interfaces that don't connect to routers.
`passive-interface <src(Rx)_interface_name>`
b. R5
i. Advertise OSPF routing to all networks on area 0
ii. Default route exit on S0/0/0
`network <interface_ip> <interface_mask> area 0`
```bash
R5> en
R5# conf t

! Start OSPF process 1
R5(config)# router ospf 1 // Join OSPF Process 1

! i. Advertise all connected networks (OSPF area 0)
! G0/0 – 161.200.240.0/21
R5(config-router)# network 161.200.240.0 0.0.7.255 area 0
! S0/0/0 – 161.200.255.16/30 (to R6)
R5(config-router)# network 161.200.255.16 0.0.0.3 area 0
! S0/0/1 – 161.200.255.24/30 (to R7)
R5(config-router)# network 161.200.255.24 0.0.0.3 area 0

! Prevent OSPF from sending updates to PC-I (host-facing interface)
R5(config-router)# passive-interface g0/0

! ii. Default route toward R6 via S0/0/0
R5(config)# ip route 0.0.0.0 0.0.0.0 s0/0/0

R5(config)# end
R5# copy run start
```
> loop this for every router in the network.


7.Disable all unused interfaces on S1, S2, S3 and S4.
`Sx(config)# interface range fa0/x-y` // `int range gi0/x - y`
`Sx(config-if-range)# shutdown` // then `exit`
```bash
// Example: mockup.
S1> en
S1# conf t

! Example: Shut down FastEthernet range 0/3 to 0/24
S1(config)# interface range fa0/3 - 24
S1(config-if-range)# shutdown
S1(config-if-range)# exit

! Optional: also shut down gigabit interfaces if not used
S1(config)# interface range gi0/1 - 2
S1(config-if-range)# shutdown

S1(config)# end
S1# copy run start
```


8.Configure VLAN on S1, S2, S3
a. Create VLAN 10 on S1, S2, S3 and assign the name VLAN10.
b. Assign interface F0/6 and F0/18 on S1 to VLAN10. The other interfaces on S1 are still in default VLAN.
c. Assign all interfaces on S2 and S3 to VLAN10.
```bash
S1> en
S1# conf t
S1(config)# vlan 10
S1(config-vlan)# name VLAN10
S1(config-vlan)# exit

! Assign PC-F port to VLAN 10
S1(config)# interface f0/1
S1(config-if)# switchport mode access
S1(config-if)# switchport access vlan 10
S1(config-if)# exit

! (Optional) Set trunk ports if required
S1(config)# interface range f0/6, f0/18
S1(config-if-range)# switchport mode trunk
S1(config-if-range)# exit

S1(config)# end
S1# copy run start

```
> loop this for every switch in the network.


9.Configure DHCP on R7
a. The DHCP will distribute class A private network.
b. Exclude the first 9 addresses to be distributed by DHCP.
c. Use the pool name R7S4
d. When the DHCP distribute IP address, assign the default gateway to the first private host IP address.

Class A private network:
Network: 10.0.0.0/8 (defined by RFC1918)
Subnet mask: 255.0.0.0
Range: 10.0.0.0 - 10.255.255.255
Usabe IPs: 10.0.0.1 - 10.255.255.254

```bash
R7> en
R7# conf t

! a + b. Exclude range 10.0.0.1 to 10.0.0.9 from the DHCP pool
R7(config)# ip dhcp excluded-address 10.0.0.1 10.0.0.9 // Reserves IPs for static use (e.g. router IP)

! c. Create DHCP pool named R7S4
R7(config)# ip dhcp pool R7S4

! Define the network range (Class A private network)
R7(dhcp-config)# network 10.0.0.0 255.0.0.0 // `network <address> <mask>`

! d. Set the default gateway (default-router) to first usable IP
R7(dhcp-config)# default-router 10.0.0.1

! (Optional) Set DNS or domain-name if needed
! R7(dhcp-config)# dns-server 8.8.8.8

R7(dhcp-config)# exit
R7(config)# end
R7# copy run start
```


10.Configure dynamic NAT on R7 to allow mapping between public and private network.
a. Specify the ports. Only g0/1 is inside NAT, the other ports are outside NAT.
b. Define access control list 1 to allow private network to be translated.
c. Define the pool of usable public IP addresses as Network 17.
d. Define the NAT from the inside source list to the outside pool.
`show ip nat translations`
```bash
R7> en
R7# conf t

! a. Define inside and outside interfaces for NAT
R7(config)# interface g0/1
R7(config-if)# ip nat inside // Marks interface as source of private IPs
R7(config-if)# exit
! All other interfaces are outside (e.g., serial)
R7(config)# interface s0/0/0
R7(config-if)# ip nat outside // Marks interfaces that send traffic to public side
R7(config-if)# exit
R7(config)# interface s0/0/1
R7(config-if)# ip nat outside
R7(config-if)# exit

! b. Create ACL 1 to match private subnet for NAT
R7(config)# access-list 1 permit 10.0.0.0 0.255.255.255 // Match any source IP from 10.0.0.0 - 10.255.255.255 to be NATed(translated)

! c. Define NAT pool (Network 17 — public IPs)
R7(config)# ip nat pool NATPOOL 10.0.0.10 10.0.0.100 netmask 255.0.0.0 //pool of "public" IPs from 10.0.0.10-10.0.0.100

! d. Link ACL to NAT pool (dynamic NAT rule)
R7(config)# ip nat inside source list 1 pool NATPOOL

R7(config)# end
R7# copy run start
```

11.Copy the running configuration to the startup configuration for all routers and switches.
`R/Sx#copy running-config startup-config`
> loop this for every router and switch.
